"""
    小结 - 函数参数
            实际参数:与形参对应
                位置实参:按顺序
                        函数名(数据1,数据2)
                    序列实参:拆
                        函数名(*序列)
                关键字实参:按名字
                        函数名(形参名 = 数据)
                    字典实参:拆
                        函数名(**字典)
            形式参数:限制实参方式
                默认形参:可选
                    def 函数名(形参名 = 数据)
                位置形参:必填
                    def 函数名(形参名1,形参名2)
                不定长形参:实参数量无限
                    星号元组形参:合(负责位置实参)
                        def 函数名(*args)
                    双星号字典形参:合(负责关键字实参)
                        def 函数名(**kwargs)
                命名关键字形参:必须使用关键字实参
                     def 函数名(*args,形参名)
                     def 函数名(*,形参名)
"""


def func01(p1=0, p2=0, p3=3):
    pass

func01(1, 2, 3)
func01(p2=2)
func01(1, p3=3)
# 注意:先写位置实参,再写关键字实参
# func01(p3=3,1)

