# 11. 画出下列代码内存图
import copy

list01 = [
    ["烤鸭", "豆汁"],
    ["火锅", "兔头"],
    ["麻花", "包子"],
]
list02 = list01
list03 = list01[:] # 复制浅层数据
list04 = copy.deepcopy(list01)

# 修改列表第一个元素(指向新列表)
list04[0] = ["全聚德", "大董"]
# print(list04)
# print(list01)

# 修改列表第一个元素的第二个元素(指向新列表)
list03[0][1] = ["全聚德", "大董"]
# [['烤鸭', ['全聚德', '大董']], ['火锅', '兔头'], ['麻花', '包子']]
print(list03)
print(list01)

# 修改列表第一个元素指向的列表元素("全聚德"   "大董" )
list02[0][:] = ["全聚德", "大董"]
# [['全聚德', '大董'], ['火锅', '兔头'], ['麻花', '包子']]
print(list02)
print(list01)
